{
  "backend/main.mo": "Motoko canister providing user profiles, daily stats, goals, and permission-checked query/update methods for per-user workout data.",
  "feature_evidence.json": "JSON report mapping feature IDs to affected frontend files, components, and test references for two rehydration and loading-state issues.",
  "frontend-file-summaries.txt": "Prewritten summaries describing responsibilities of each frontend file, especially counter, stats, and loading-state logic.",
  "frontend/index.css": "Tailwind base styles defining OKLCH-themed color variables for light and dark modes.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up routing, theming, Internet Identity provider, and QueryClient for the app’s main layout and screens.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button handling Internet Identity login/logout with loading states and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog prompting authenticated users without a saved profile to enter their name before using the app.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout with header navigation, login button, profile setup dialog, routed content, and footer.",
  "frontend/src/features/counter/CounterScreen.tsx": "Main counter UI handling rep input, daily totals, goals, authentication-aware logic, and reset dialogs.",
  "frontend/src/features/counter/ResetSessionDialog.tsx": "Dialog component to confirm resetting the current set counter.",
  "frontend/src/features/counter/ResetTodayDialog.tsx": "Dialog component to confirm resetting today's total reps for unauthenticated users.",
  "frontend/src/features/counter/RestTimer.tsx": "Empty placeholder file for a rest timer component.",
  "frontend/src/features/counter/useLocalDailyGoal.ts": "Hook for storing and retrieving the user's daily goal in localStorage with day rollover handling.",
  "frontend/src/features/counter/useLocalTodayTally.ts": "Hook for tracking today's reps and sets locally, persisting to localStorage and resetting on day change.",
  "frontend/src/features/counter/useWorkoutSession.ts": "Empty placeholder file for workout session logic.",
  "frontend/src/features/history/HistoryListView.tsx": "Empty placeholder file for a workout history list view.",
  "frontend/src/features/history/SessionDetailView.tsx": "Empty placeholder file for session detail view.",
  "frontend/src/features/stats/StatsView.tsx": "Stats UI showing reps, sets, and goal progress for today or a selected date with auth-aware data sources.",
  "frontend/src/features/stats/useUserStats.ts": "Empty placeholder file for user stats logic.",
  "frontend/src/hooks/useActor.ts": "React Query hook to create and manage an authenticated or anonymous backend actor and invalidate dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity authentication, including login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks to load and mutate user profile, daily totals, stats, and goals through the backend actor with Internet Identity gating.",
  "frontend/src/index.css": "Sets Tailwind base layers and defines light/dark OKLCH design tokens and global styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers and loads global styles.",
  "frontend/src/utils/dayStamp.ts": "Provides helpers to convert dates to day-stamp bigint identifiers and to format or parse local date strings.",
  "frontend/src/utils/urlParams.ts": "Implements URL and sessionStorage utilities for reading, persisting, and clearing URL parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, color tokens, fonts, animations, plugins, and dark mode settings.",
  "project_state.json": "Captures project metadata, requirements, known issues, and current architectural guidance for the pull-up counter app."
}