{
  "backend/main.mo": "Motoko canister managing user profiles and daily workout stats with access control and time-based day calculations.",
  "backend/migration.mo": "Migration module defining stored actor types and passing state through unchanged.",
  "feature_evidence.json": "Feature evidence report listing features, related files, components, and test IDs for recent work.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files for reference in build planning.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables and theming for light and dark modes.",
  "frontend/index.html": "Base HTML file mounting the root element and loading the main React entrypoint.",
  "frontend/src/App.tsx": "Sets up routing, theming, React Query, identity provider, and renders the app layout.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity authentication and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog prompting authenticated users without a profile to enter and save their name.",
  "frontend/src/components/layout/AppLayout.tsx": "App layout with header, navigation tabs, login button, profile setup dialog, and footer.",
  "frontend/src/features/counter/CounterScreen.tsx": "Main pull-up counter UI handling reps, daily goals, authentication state, and local vs backend data sync with dialogs for reset actions.",
  "frontend/src/features/counter/ResetSessionDialog.tsx": "Confirmation dialog for resetting the current set count to zero.",
  "frontend/src/features/counter/ResetTodayDialog.tsx": "Confirmation dialog for resetting today's total reps to zero.",
  "frontend/src/features/counter/RestTimer.tsx": "Empty placeholder file for a rest timer component.",
  "frontend/src/features/counter/useLocalDailyGoal.ts": "Manages a local daily goal stored in localStorage with automatic day rollover handling.",
  "frontend/src/features/counter/useLocalTodayTally.ts": "Tracks today's local reps and sets in localStorage with automatic day rollover and helper functions to add and reset.",
  "frontend/src/features/counter/useWorkoutSession.ts": "Empty placeholder file for workout session logic.",
  "frontend/src/features/history/HistoryListView.tsx": "Empty placeholder file for listing workout history.",
  "frontend/src/features/history/SessionDetailView.tsx": "Empty placeholder file for viewing session details.",
  "frontend/src/features/stats/StatsView.tsx": "Displays stats for today or selected dates, using backend for authenticated users and local data for guests.",
  "frontend/src/features/stats/useUserStats.ts": "Empty placeholder file for user stats logic.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login/logout handling, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user profile, daily totals, stats, and goals using the backend actor with authentication checks.",
  "frontend/src/index.css": "Defines Tailwind base layers and theme variables for light/dark mode, applying global background, text, and border styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/utils/dayStamp.ts": "Utilities for converting dates and strings to bigint day stamps and generating today's date/day stamp.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL params, persisting them in sessionStorage, and clearing them from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind configuration extending typography, container queries, colors, radius, animations, and theme tokens.",
  "project_state.json": "Project metadata describing scope, requirements, issues, and architectural notes for the pull‑up counter app."
}