{
  "backend/main.mo": "Motoko canister implementing user profiles and daily workout stats with access control, day-based queries, and profile saving.",
  "backend/migration.mo": "Migration module defining stored state types and a no-op migration that returns the prior actor data.",
  "feature_evidence.json": "Feature evidence report linking a frontend error-handling requirement to specific files and components with high confidence.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files describing their functionality and roles in the app.",
  "frontend/index.css": "Tailwind base and custom OKLCH color variables defining light and dark theme styles.",
  "frontend/index.html": "Minimal HTML entry point mounting the React app and loading the main script.",
  "frontend/src/App.tsx": "Root React component wiring router, query client, themes, and Internet Identity provider.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button handling login/logout flows with loading states and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal prompting new authenticated users to enter a name and save their profile.",
  "frontend/src/components/layout/AppLayout.tsx": "App layout with header, navigation tabs, login button, profile dialog, routed content, and footer.",
  "frontend/src/features/counter/CounterScreen.tsx": "Main pull-up counter UI handling reps, daily totals, goals, and authenticated vs guest logic.",
  "frontend/src/features/counter/ResetSessionDialog.tsx": "Dialog prompting the user to confirm resetting the current set counter.",
  "frontend/src/features/counter/ResetTodayDialog.tsx": "Dialog prompting the user to confirm resetting today's total reps.",
  "frontend/src/features/counter/RestTimer.tsx": "Empty placeholder for a rest timer component.",
  "frontend/src/features/counter/useLocalDailyGoal.ts": "Hook for storing and retrieving today's pull-up goal in localStorage with day rollover handling.",
  "frontend/src/features/counter/useLocalTodayTally.ts": "Hook managing today's reps and sets in localStorage with automatic reset on day change.",
  "frontend/src/features/counter/useWorkoutSession.ts": "Empty placeholder for workout session logic.",
  "frontend/src/features/history/HistoryListView.tsx": "Empty placeholder for listing past workout history.",
  "frontend/src/features/history/SessionDetailView.tsx": "Empty placeholder for viewing details of a past session.",
  "frontend/src/features/stats/StatsView.tsx": "Stats screen displaying daily or selected-date reps, sets, and goal progress for authenticated or guest users.",
  "frontend/src/features/stats/useUserStats.ts": "Empty placeholder for user stats logic.",
  "frontend/src/hooks/useActor.ts": "Hook creating and managing the backend actor tied to the user's identity and invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Authentication provider and hook for loading, maintaining, and exposing Internet Identity state and login actions.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for loading and mutating user profile, daily totals, stats, and goals using an actor from Internet Identity.",
  "frontend/src/index.css": "Sets Tailwind base styles and CSS variables for light/dark themes with OKLCH color tokens.",
  "frontend/src/main.tsx": "Bootstraps the React app, configuring React Query and Internet Identity providers.",
  "frontend/src/utils/dayStamp.ts": "Provides helpers to convert dates and strings to bigint day stamps and get today's date values.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, persisting, and clearing URL parameters using query strings and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, containers, and animations using CSS variables.",
  "project_state.json": "Project metadata describing scope, issues, and feature requirements for the pull-up counter app."
}