{
  "backend/main.mo": "Motoko backend implementing user profiles, daily reps/set stats, daily goals, and permission-checked queries and updates using AccessControl.",
  "feature_evidence.json": "Feature evidence report linking features to affected frontend files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file including components, hooks, views, and utilities.",
  "frontend/index.css": "Tailwind CSS base/theme definitions using OKLCH color tokens with light/dark mode variables and global styling.",
  "frontend/index.html": "HTML entry point defining root element and loading the main TypeScript bundle.",
  "frontend/src/App.tsx": "Sets up the app’s router, query client, theme provider, and Internet Identity provider, defining Counter and Stats routes.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button handling Internet Identity login/logout with loading states and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog prompting first‑time authenticated users to enter and save their name via backend profile APIs.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout with header navigation, login button, profile setup dialog, routed content, and footer branding.",
  "frontend/src/features/counter/CounterScreen.tsx": "Main pull-up counter UI that manages reps, daily goals, and logging sets with support for authenticated and local storage modes.",
  "frontend/src/features/counter/ResetSessionDialog.tsx": "Confirmation dialog for resetting the current set rep counter to zero.",
  "frontend/src/features/counter/ResetTodayDialog.tsx": "Confirmation dialog for resetting today's total reps and sets.",
  "frontend/src/features/counter/RestTimer.tsx": "Empty placeholder file for a rest timer component.",
  "frontend/src/features/counter/useLocalDailyGoal.ts": "Hook that stores and retrieves the user's daily goal in localStorage with date rollover handling.",
  "frontend/src/features/counter/useLocalTodayTally.ts": "Hook that tracks today's reps and sets in localStorage and updates on date rollover.",
  "frontend/src/features/counter/useWorkoutSession.ts": "Empty placeholder file for workout session logic.",
  "frontend/src/features/history/HistoryListView.tsx": "Empty placeholder file for viewing workout history.",
  "frontend/src/features/history/SessionDetailView.tsx": "Empty placeholder file for viewing details of a specific workout session.",
  "frontend/src/features/stats/StatsView.tsx": "Displays daily and historical stats, choosing between backend and local data depending on authentication.",
  "frontend/src/features/stats/useUserStats.ts": "Empty placeholder file for user stats hooks.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication via Internet Identity, managing identity state, login, and logout.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user stats, goals, and profile via the backend actor.",
  "frontend/src/index.css": "Defines Tailwind base layers and a full set of CSS variables for light/dark themes, applying global background, foreground, and border styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and an Internet Identity provider before rendering App.",
  "frontend/src/utils/dayStamp.ts": "Provides helpers to convert dates and date strings into bigint day-stamp identifiers and retrieve today's stamp or date string.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, clearing, and syncing URL parameters with sessionStorage, supporting hash-based routing.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom color tokens, typography, animations, container settings, and extended theme values tied to CSS variables.",
  "project_state.json": "Project metadata describing features, architecture notes, known issues, and current scope for a pull‑up counter app."
}