{
  "kind": "build_request",
  "title": "Fix stats resetting by making day tracking timezone-safe and persisting backend state across upgrades",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-34",
      "text": "Investigate and fix the cause of user stats (today reps/sets and daily goal) appearing to reset unexpectedly, ensuring stats remain consistent across refreshes and over time for both authenticated (backend-synced) and unauthenticated (local-only) modes.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "doesn't seem to be keeping my stats? keeps resetting itself or something."
        ]
      },
      "acceptanceCriteria": [
        "Unauthenticated mode: after logging sets, refreshing the page does not reset today's reps/sets unexpectedly.",
        "Authenticated mode: after logging sets, refreshing the page does not reset today's reps/sets unexpectedly.",
        "If a reset occurs due to an actual day rollover, the rollover behavior is consistent and explainable (i.e., not triggered mid-day due to timezone/UTC mismatches)."
      ]
    },
    {
      "id": "REQ-35",
      "text": "Update unauthenticated (local-only) persistence to use a stable 'local day' key (not UTC-based) so that local today reps/sets and local daily goal do not reset during the user’s local day due to UTC date changes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "doesn't seem to be keeping my stats? keeps resetting itself or something."
        ]
      },
      "acceptanceCriteria": [
        "In a non-UTC timezone, local-only stats and local daily goal do not roll over until the device’s local date changes.",
        "Local-only stats (reps and sets) and local daily goal persist correctly across page refreshes on the same local day."
      ]
    },
    {
      "id": "REQ-36",
      "text": "Make authenticated day-based stats calculations timezone-safe by ensuring the frontend and backend agree on what 'today' means. Implement and use a single consistent approach for computing the day identifier used to read/write daily stats so authenticated users do not see mid-day resets caused by UTC/local day boundary mismatches.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "doesn't seem to be keeping my stats? keeps resetting itself or something."
        ]
      },
      "acceptanceCriteria": [
        "Authenticated mode: logging a set increments the same 'today' bucket that is displayed on both the Counter and Stats screens, without unexpected resets during the user’s local day.",
        "Stats screen: the 'Today' view matches what the Counter screen shows for authenticated users.",
        "Historical day selection continues to work for authenticated users after the change (no regressions in selecting and viewing prior days)."
      ]
    },
    {
      "id": "REQ-37",
      "text": "Persist backend state for user profiles, per-user per-day stats, and per-user daily goals across canister upgrades by storing/restoring state using stable variables and appropriate upgrade hooks, so values do not reset after deployments/upgrades.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "doesn't seem to be keeping my stats? keeps resetting itself or something."
        ]
      },
      "acceptanceCriteria": [
        "After a canister upgrade, previously recorded authenticated user daily stats (reps/sets) remain available.",
        "After a canister upgrade, previously saved authenticated user daily goal remains available (for the applicable day semantics used by the app).",
        "No data loss occurs for existing users’ stored stats/goals during upgrade in normal operation."
      ]
    },
    {
      "id": "REQ-38",
      "text": "Ensure React Query cache invalidation/refetch behavior does not accidentally present 'reset' values (e.g., transient zeros) when identity/actor changes or queries refetch; loading/error states should not be misrepresented as real zero stats.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "doesn't seem to be keeping my stats? keeps resetting itself or something."
        ]
      },
      "acceptanceCriteria": [
        "Authenticated mode: if stats queries are loading/refetching, the UI does not misleadingly present a reset-to-zero state as final data.",
        "If a backend query fails (e.g., unauthorized), the UI surfaces an error state/message rather than silently showing 0 as if stats were reset."
      ]
    }
  ],
  "constraints": [
    "Respect the single-actor backend architecture (all Motoko logic stays in backend/main.mo).",
    "Only add backend/migration.mo if a state upgrade/migration is required to preserve existing deployed data.",
    "Do not modify files under frontend/src/components/ui or any other frontend immutable paths listed in SYSTEM_CONTEXT.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Adding new tabs/screens beyond the existing Counter and Stats routes.",
    "Reintroducing session-based workout history or 7-day trend UI/features.",
    "Adding third-party analytics, external databases, or non-Internet-Identity authentication."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}