{
  "kind": "build_request",
  "title": "Fix data persistence across refresh/browser restart (guest localStorage + authenticated backend state)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-39",
      "text": "Investigate and fix why a user’s logged sets/today totals and daily goal can appear to disappear after a page refresh or browser restart, and ensure values rehydrate correctly on app load for both unauthenticated (local-only) and authenticated (backend-synced) modes.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "data doesn't seem persistent. when I refresh the page or close the browser, its gone"
        ]
      },
      "acceptanceCriteria": [
        "As a guest (not signed in), after logging a set and/or setting a daily goal, refreshing the page preserves the same Today total/sets and goal for the current local day.",
        "As a guest, closing the browser and reopening the app preserves the same Today total/sets and goal for the current local day.",
        "As an authenticated user, after logging a set and/or setting a daily goal, refreshing the page preserves the same Today total and goal (no reverting to empty/zero as the final state).",
        "The Stats screen reflects the same persisted values after refresh/reopen when viewing the current day."
      ]
    },
    {
      "id": "REQ-40",
      "text": "Update the frontend to avoid presenting transient loading states as real “reset” values for authenticated users on initial load/refresh (e.g., showing 0/null totals/goals while identity/actor/queries are initializing). Use explicit loading/placeholder UI until backend values are fetched or an error state is confirmed.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "when I refresh the page ... its gone"
        ]
      },
      "acceptanceCriteria": [
        "When authenticated, the Counter screen does not render Today’s Total as 0 solely because React Query data is not yet loaded; it shows a loading indicator/skeleton/placeholder until the query resolves or errors.",
        "When authenticated, the Daily Goal input does not clear solely due to initialization/refetch; it remains in a loading state until the goal query resolves or errors.",
        "If backend queries error, the UI shows an error state (not a 0-value state) and offers a clear retry path or instructions."
      ]
    },
    {
      "id": "REQ-41",
      "text": "Persist authenticated user data in the Motoko canister across upgrades by storing and restoring all required state in stable variables via upgrade hooks, including (at minimum) user profiles, per-user per-day stats/totals, and per-user daily goals.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "when I refresh the page or close the browser, its gone"
        ]
      },
      "acceptanceCriteria": [
        "After an authenticated user logs sets and sets a daily goal, those values remain available after a canister upgrade/redeploy (no data loss).",
        "Backend read APIs (e.g., getTodayStats/getTodayTotal/getDayStats/getTodayGoal) return the previously stored values after upgrade.",
        "Backend write APIs (e.g., incrementTodayTotal/setTodayGoal/saveCallerUserProfile) continue to work after upgrade without requiring manual resets."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit files under frontend/src/components/ui or other frontend immutable paths listed in SYSTEM_CONTEXT.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Adding new product features unrelated to persistence (e.g., new workout modes, new tabs, new charts).",
    "Introducing external databases or third-party storage providers."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}