{
  "kind": "build_request",
  "title": "Fix backend persistence so user data survives refreshes and deployments",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-42",
      "text": "Implement canister state persistence for authenticated user data so it does not reset after deployments/upgrades. Persist and restore, at minimum: userProfiles, per-user per-day dailyStats (reps + sets keyed by dayStamp), and userDailyGoals.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "No. Still not working. Data is not persistent."
        ]
      },
      "acceptanceCriteria": [
        "After logging sets while signed in, then redeploying/upgrading the canister, the signed-in user still sees the same Today total and Today stats for the current day.",
        "After setting a daily goal while signed in, then redeploying/upgrading the canister, the goal value is still returned by getTodayGoal and shown in the UI.",
        "After redeploying/upgrading the canister, previously saved per-day stats remain queryable via getDayStats(dayStamp) for historical days (where data existed before the upgrade)."
      ]
    },
    {
      "id": "REQ-43",
      "text": "Add safe preupgrade/postupgrade hooks in backend/main.mo that serialize non-stable in-memory structures into stable variables and reconstruct them on upgrade, without changing the public API shape.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Data is not persistent."
        ]
      },
      "acceptanceCriteria": [
        "backend/main.mo defines stable variables that fully capture the data needed to rebuild userProfiles, dailyStats, and userDailyGoals.",
        "system preupgrade() saves current in-memory state into stable variables.",
        "system postupgrade() restores in-memory state from stable variables so subsequent calls return the same values as before the upgrade.",
        "The existing query/update methods (e.g., getTodayTotal, getTodayStats, incrementTodayTotal, getDayStats, getTodayGoal, setTodayGoal) continue to compile and behave consistently after introducing upgrade hooks."
      ]
    },
    {
      "id": "REQ-44",
      "text": "Ensure the frontend does not misrepresent backend persistence failures as valid zero values for authenticated users: when backend queries fail (e.g., due to traps/upgrade issues), show an explicit error state with a retry action (do not silently fall back to 0). Apply this to Today total/goal on Counter and stats/goal on Stats.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Still not working. Data is not persistent."
        ]
      },
      "acceptanceCriteria": [
        "When authenticated backend calls error, Counter screen shows the existing error UI (with Retry) instead of showing 0 as a normal value.",
        "When authenticated backend calls error, Stats screen shows an explicit error state (with Retry) instead of showing 0 as a normal value.",
        "Retry actions refetch the correct queries and, once the backend is healthy, show the persisted values."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui."
  ],
  "nonGoals": [
    "Do not add new workout features or new screens beyond fixing persistence and related error presentation.",
    "Do not add external databases or non-Internet-Computer storage providers."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}