{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix persistence + correct authenticated rehydration/loading states",
  "requirements": [
    {
      "id": "REQ-39",
      "summary": "Ensure guest localStorage state and authenticated backend-synced state rehydrate correctly on app load/refresh so Today totals/sets and daily goal don’t appear to disappear.",
      "acceptanceCriteria": [
        "As a guest (not signed in), after logging a set and/or setting a daily goal, refreshing the page preserves the same Today total/sets and goal for the current local day.",
        "As a guest, closing the browser and reopening the app preserves the same Today total/sets and goal for the current local day.",
        "As an authenticated user, after logging a set and/or setting a daily goal, refreshing the page preserves the same Today total and goal (no reverting to empty/zero as the final state).",
        "The Stats screen reflects the same persisted values after refresh/reopen when viewing the current day."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update authenticated React Query hooks (today total, today stats, day stats, today goal) to expose actor-aware loading/ready state (e.g., treat “actor is initializing / query disabled” as loading, not as loaded-empty), and ensure callers can reliably distinguish between “not fetched yet” vs “fetched and empty (null)”. This supports correct rehydration without transient zero/blank render. Verify the selected authorization component’s frontend usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/counter/CounterScreen.tsx",
          "operation": "modify",
          "description": "Adjust authenticated-mode rendering so Today Total and Daily Goal derive from backend values only after the relevant queries have actually fetched; avoid mapping undefined/not-fetched states to 0/null. Keep guest mode using existing localStorage hooks so values rehydrate on refresh/restart for the current local day. Verify the selected authorization component’s frontend usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/stats/StatsView.tsx",
          "operation": "modify",
          "description": "Ensure authenticated-mode Stats for today (and goal progress) uses backend values only after queries are fetched; prevent transient 0/empty stats during actor/query initialization. Keep guest mode reading today’s values from localStorage-backed hooks to preserve refresh/restart persistence. Verify the selected authorization component’s frontend usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-40",
      "summary": "Prevent transient authenticated loading states from appearing as real reset values; show explicit loading/placeholder UI and error-with-retry instead of 0/null while identity/actor/queries initialize.",
      "acceptanceCriteria": [
        "When authenticated, the Counter screen does not render Today’s Total as 0 solely because React Query data is not yet loaded; it shows a loading indicator/skeleton/placeholder until the query resolves or errors.",
        "When authenticated, the Daily Goal input does not clear solely due to initialization/refetch; it remains in a loading state until the goal query resolves or errors.",
        "If backend queries error, the UI shows an error state (not a 0-value state) and offers a clear retry path or instructions."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Standardize hook return shapes to include correct composite loading flags (actor initializing + query loading), fetched/ready flags, and access to refetch where needed so screens can render placeholders and provide a retry action rather than rendering zero-values. Verify the selected authorization component’s frontend usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/counter/CounterScreen.tsx",
          "operation": "modify",
          "description": "Replace any authenticated initial render paths that show 0/empty goal due to not-yet-fetched data with explicit loading placeholders. On query error, show an error state with a clear retry action (using the query refetch) rather than showing 0/null. Verify the selected authorization component’s frontend usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/stats/StatsView.tsx",
          "operation": "modify",
          "description": "Ensure authenticated stats and goal progress do not render 0/empty during initialization; show loading placeholders until fetched, and on error show an explicit error state with a retry action (using query refetch) instead of a 0-value UI. Verify the selected authorization component’s frontend usage instructions before implementing."
        }
      ]
    }
  ]
}